Revit 2027 API
FlowConversionMode Enumeration
 Enumerated type listing possible flow conversion modes for piping calculations.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FlowConversionMode
Public Enumeration FlowConversionMode
public enum class FlowConversionMode
type FlowConversionMode
Members
Member name | Value | Description
Invalid | -1 |  A default value which should not be assigned to system types.
Tanks | 1 |  Predominantly flush tanks.
Valves | 0 |  Predominantly flush valves.
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace